import java.util.Scanner;
import java.util.Random;

public class Main {

    public enum TairyAnimals {
        BIRD,
        WOLF,
        ANT

    };

    public static void main(String[] args) {

        int health = 100;
        int luck = 50;

        System.out.println("Привіт, відважний герою!");
        System.out.println("Тебе чекає цікава подорож до чарівного лісу");
        System.out.println("На початку гри ти маєшь здоров'я "+ health + " вдачу "+ luck);
        System.out.println("+++++++++++++Подія 1+++++++++++++++++++");
        System.out.println("Ти довго йшов чарівною стежкою, і  раптом....") ;
        System.out.println("Стоїть камінь край роздоріжжя. На нім напис - мов шепіт з ніччя: Пильнуй, подорожній, свій перший крок,бо шлях обираєшь на сотні строк");
        System.out.println("Наліво підеш - дорога туманна, тиша густа, а земля - мов зітхання. Тут крок за кроком все важче іти, і кожна стежина ховає сліди");
        System.out.println("Направо підеш - між гіллям проміння, сонце шепоче тобі привітання. Хоч терен і хащі зустрінеш не раз, та сердце відчує - це твій є час");
        System.out.println("Не все тут є явним , не все до пуття, та вибір твій - ключ до твого буття: 1 - піти наліво, 2 - піти направо");

        Scanner sc = new Scanner(System.in);
        int choice1 = sc.nextInt();

        if (choice1 == 1) {
            System.out.println("Пішов ти наліво - туман обійняв. І кожен твій крок трохи сил забирав");
            System.out.println("На жаль, ви втратили 30 пунктів здоров'я");
            health = health - 30;  // відняти очки здоров*я

        } else if (choice1 == 2) {
            System.out.println("Праворуч обрав - і світанок зійшов, у кроці -натхнення, у сердці - любов");
            System.out.println("Всесвіт подарував вам 20 пунктів вдачі");
            luck = luck +20;

            // додати очки удачі
        } else {
            System.out.println("Не ліво, не право - свій вибір сховав, і лісом блукає, шукає підстав");
            System.out.println("На жаль, ви втратили 10 пунктів здоров'я");
            health -= 10;
            // відняти очки здоров*я
        }
        System.out.println("Ваші поточні показники здоров'я "+ health + " та вдачі "+ luck);
        System.out.println("+++++++++++++Подія 2+++++++++++++++++++");

        System.out.println("Ішов далі мандрівник, шляхом обраним свідомо, ліс шумів казково, і тиша дихала солоно");
        System.out.println("Та ось серед гаю, в западині землі - колодязь старезний з'явивсь у імлі.");
        System.out.println("На камені поруч, мохом порослім: Тут вибір не легкий - як і завше з ним. Напийся і приймеш незнаний дар");
        System.out.println("Минеш - і збережеш, що маєш зараз. Не вибереш - знай: Вода сама вибере, хто ти і край.");
        System.out.println("Попити води - напиши 1, ігнорувати колодязь - напиши 2");

        int choice2 = sc.nextInt();

        if (choice2 == 1) {
            System.out.println("Напивсь- і тіло знов засяяло, Сили вернулись, мов весна розквітла");
            System.out.println("Ти відновив здоров'я на 50 пунктів");
            health = health + 50;  // відняти очки здоров*я

        } else if (choice2 == 2) {
            System.out.println("Минув ти колодязь - і втома швидко зжала. Удача втекла, мов тінь з темряви мала");
            System.out.println("Ти втратив 10 пунктів вдачі, але здоров'я зберіг");
            luck -= 10;

             } else {
            System.out.println("Нічого не обрав - все так і лишилось, ні шкоди, ні дару - мов вода в колодязі вмилася");
            System.out.println("Ваші показники здоров'я та вдачі не змінилися");

        }
        System.out.println("Ваші поточні показники здоров'я "+ health + " та вдачі "+ luck);
        System.out.println("+++++++++++++Подія 3+++++++++++++++++++");
        System.out.println("Дорога вела крізь пагорби й тінь, аж раптом з'явилась істота - як мрія чи сплін ");
        System.out.println("Три зустрічі- різні , як ніч і світанок , і кожна лишила свій таємний знак");
        Random rand = new Random();
        int choice3 = rand.nextInt(3) + 1;

        TairyAnimals animal = TairyAnimals.values()[choice3];

        switch (animal) {
            case BIRD ->{
                    System.out.println("Пташка небесна з крильцем ясним -сіла на плече і поділилась хлібом.");
                    System.out.println("Здоров'я вернулось, мов роса на траві, і легше ступати в подальшій ході");
                    System.out.println("Ти зустрів дружню Пташку та відновив здоров'я на 20 пунктів");
                    health = health + 20;
            }
            case WOLF ->{
                System.out.println("Аж ось із хащі - вовчище лютий. В очах його блиск і намір закутий");
                System.out.println("Напав без слів, наче буря зимова , і з силою разом пішла частка здоров'я");
                System.out.println("На тебе напав злий Вовк і ти втратив здоров'я на 30 пунктів");
                health = health - 30;
            }
            case ANT ->{
                System.out.println("А бува - на шляху лиш мураха повзе, його не хвилює, кіди хто іде");
                System.out.println("Зустріч минула без втрат і дарів, як вітер байдужий поміж дерев");
                System.out.println("Байдужа мурашка не змінила твої показники здоров'я і вдачі");
            }
            default -> System.out.println("Нікого не зустрів");

        }
        System.out.println("Ваші поточні показники здоров'я "+ health + " та вдачі "+ luck);

        if (health > 0 && luck > 0) {
            System.out.println("Чарівний ліс залишився позаду. Стежка вела до нового складу");
            System.out.println("Вітаємо , ти подолав чарівний ліс");
        } else  {
            System.out.println("Стежка сховалась в тумані й гіллі. Герой зник без сліду в нічній імлі");
            System.out.println("На жаль, ти не пройшов чарівний ліс. Спробуй ще раз");
        };


    }

}
